app/views/articles/show.html.erb


<h3>Comments{<%= @article.comments.count %>}</h3>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = 1