app/controllers/articles_controller.rb

INSERT INTO "articles" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "this is article"], ["created_at", Thu, 19 Jul 2012 01:53:32 UTC +00:00], ["title", "hello"], ["updated_at", Thu, 19 Jul 2012 01:53:32 UTC +00:00]]
---
def create
    @article = Article.new(params[:article])
    @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "28"]]
DELETE FROM "articles" WHERE "articles"."id" = 28
---
  def destroy
  @article = Article.find(params[:id])
  if @article.delete

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "articles" SET "body" = 'Wikipedia is a free, collaboratively edited, and multilingual Internet encyclopedia supported by the non-profit Wikimedia Foundation. Its 22 million articles (over 4 million in English alone) have been written collaboratively by volunteers around the world. Almost all of its articles can be edited by anyone with access to the site and it has about 100,000 regularly active contributors.[5][6] As of August 2012, there are editions of Wikipedia in 285 languages. It has become the largest and most popular general reference work on the Internet,[7][8][9][10] ranking sixth globally among all websites on Alexa and having an estimated 365 million readers worldwide.[7][11] It is estimated that Wikipedia receives 2.7 billion monthly page views from the United States alone.
---
def update
    @article = Article.find(params[:id])
    @article.update_attributes(params[:article])