app/controllers/authors_controller.rb

  def create
    @author = Author.new(params[:author])

    respond_to do |format|
      if @author.save
---
INSERT INTO "authors" ("created_at", "crypted_password", "email", "salt", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @author = Author.find(params[:id])

    respond_to do |format|
      if @author.update_attributes(params[:author])
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "authors" SET "salt" = 'jC2Z58KwBhUVt2vyNaqT', "crypted_password" = '$2a$10$o1CvNj9R7mNR82KhR6DYi.plY/HetGSNpxw1lHQTfgOpLal3jQS6.', "updated_at" = '2012-08-20 11:35:27.683873' WHERE "authors"."id" = 3